M = str(prob['args']['max'])

Tbl = [
	["测试点", "$n=$", "$k\le $$", "$W= $", "地图是一条链"],
	[1,		"3",		"$n$",		M, 		"保证"],
	[2,		"15",		"$n$",		M,		"不保证"],
	[3,		"20",		"$n$",		M,		"不保证"],
	[4,		"300",		"$n$",		"10",	"保证"],
	[5,		M,			"$n$",		M,		"保证"],
	[6,		"50",		"$n$",		M,		"不保证"],
	[7,		"200",		"$n$",		M,		"不保证"],
	[8,		"500",		"$n$",		M,		"不保证"],
	[9,		"1111",		"100",		"100",	"不保证"],
	[10,	"1111",		"50",		"1111",	"不保证"],
	[11,	"1111",		"100",		M,		"不保证"],
	[12,	M,			"100",		M,		"不保证"],
	[13,	M,			"200",		M,		"不保证"],
	[14,	M,			"500",		M,		"不保证"],
	[15,	M,			"$n$",		M,		"不保证"],
	[16,	M,			"$n$",		M,		"不保证"],
	[17,	M,			"$n$",		M,		"不保证"],
	[18,	M,			"$n$",		M,		"不保证"],
	[19,	M,			"$n$",		M,		"不保证"],
	[20,	M,			"$n$",		M,		"不保证"],
]
for i in range(1, 21):
	for j in range(1, 5):
		try:
			k = int(Tbl[i][j])
			Tbl[i][j] = str(tl.hn(k))
		except:
			pass

return merge_ver(Tbl)
