ret = [["测试点","$maxn=$","$\sum n\leq$","特殊性质"]]
N=[8,9,11,12,14,14,16,16,17,100,150,180,200,800,900,1000,266666,333333,444444,600000]
M=["5maxn","5maxn","5maxn","5maxn","5maxn","5maxn","5maxn","5maxn","5maxn",700,700,700,700,4000,4000,4000,1500000,1500000,1500000,1500000]
S=[9,13,16]

for i in range(20):
	n = N[i]
	m = M[i]
	w = "\\text{无性质}"
	if(i in S):
		w = "\\text{输入均是长度为} n \\text{字典序最小的排列}" 
		#\\text{输入的均是长度为} n \\text{的字典序最小的排列}
	row = [
		i+1,
		"$%s$" % n,
		"$%s$" % m,
		"$%s$" % w,
		]
	ret.append(row)
return merge_ver(ret)
