ret = [["测试点","$n_{max}=$","$\sum n\leq$","特殊性质"]]
N=[8,9,11,12,13,14,16,16,17,18,18,122,144,166,200,233,777,888,933,1000,266666,333333,444444,555555,600000]
M=["5n_{max}","5n_{max}","5n_{max}","5n_{max}","5n_{max}","5n_{max}","5n_{max}","5n_{max}","5n_{max}","5n_{max}","5n_{max}",700,700,700,700,700,4000,4000,4000,4000,2000000,2000000,2000000,2000000,2000000]
S=[11,16,20]

for i in range(25):
	n = N[i]
	m = M[i]
	w = "\\text{无}"
	if(i in S):
		w = "\\forall i ~~p_i=i" 
		#\\text{输入的均是长度为} n \\text{的字典序最小的排列}
	row = [
		i+1,
		"$%s$" % n,
		"$%s$" % m,
		"$%s$" % w,
		]
	ret.append(row)
return merge_ver(ret)
